In [81]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy.types import Integer, Float
engine = create_engine('sqlite://', echo=False)

In [82]:
d = {'measurement': ['Tc1', 'Tc1', 'Th1', 'Th1', 'Tc2', 'Tc2', 'Th2', 'Th2'], 'position': ['x1', 'x1', 'x1', 'x1', 'x2', 'x2', 'x2', 'x2'], 'temperature': [50.5, 51.0, 80.9, 81.0, 60.3, 59.3, 70.2, 71.6], 'Timestamp': [1543507200000000000, 1543507245000000000, 1543507200000000000, 1543507245000000000, 1543507200000000000, 1543507245000000000, 1543507200000000000, 1543507245000000000]}

In [83]:
df = pd.DataFrame(data=d)

In [84]:
Tc1 = df.loc[df['measurement']=='Tc1']
Th1 = df.loc[df['measurement']=='Th1']
Tc2 = df.loc[df['measurement']=='Tc2']
Th2 = df.loc[df['measurement']=='Th2']
Tc1

  measurement position  temperature            Timestamp
0         Tc1       x1         50.5  1543507200000000000
1         Tc1       x1         51.0  1543507245000000000

In [85]:
Tc1.to_sql('Tc1', con=engine, index=False, dtype={"temperature": Float(), "Timestamp": Integer()})

In [86]:
Th1.to_sql('Th1', con=engine, index=False, dtype={"temperature": Float(), "Timestamp": Integer()})
Tc2.to_sql('Tc2', con=engine, index=False, dtype={"temperature": Float(), "Timestamp": Integer()})
Th2.to_sql('Th2', con=engine, index=False, dtype={"temperature": Float(), "Timestamp": Integer()})

In [87]:
query = "SELECT * FROM Tc1"
engine.execute(query).fetchall()

[('Tc1', 'x1', 50.5, 1543507200000000000),
 ('Tc1', 'x1', 51.0, 1543507245000000000)]

In [97]:
query = "SELECT Tc1.Timestamp, Tc1.measurement, Tc1.position, Tc1.temperature, Tc2.measurement, Tc2.position, Tc2.temperature FROM Tc1 INNER JOIN Tc2 ON Tc1.Timestamp=Tc2.Timestamp;"

In [98]:
engine.execute(query).fetchall()

[(1543507200000000000, 'Tc1', 'x1', 50.5, 'Tc2', 'x2', 60.3),
 (1543507245000000000, 'Tc1', 'x1', 51.0, 'Tc2', 'x2', 59.3)]